Metaln00b/ESP8266-CurrentDiagReceiver/src/main.cpp
#include <Wire.h>
#include <ESP8266WiFi.h>
#include <ESP8266WiFiAP.h>
#include <ESPAsyncTCP.h>
#include <ESPAsyncWebServer.h>
#include <ArduinoJson.h>
#include <ElegantOTA.h>
#include <WiFiUdp.h>
#include <ESP8266WiFiGratuitous.h>
#include <TFT_eSPI.h>
#include <SPI.h>
#include <LittleFS.h>

#define DRAW_DIGITS

#ifdef DRAW_DIGITS
  #include "NotoSans_Bold.h"
  #include "OpenFontRender.h"
  #define TTF_FONT NotoSans_Bold
#endif

TFT_eSPI display = TFT_eSPI();
TFT_eSprite spr = TFT_eSprite(&display);

#ifdef DRAW_DIGITS
OpenFontRender ofr;
#endif

const char* ssid = "CurrentDiagReceiver";
const char* pass = "123456789";

AsyncWebServer server(80);

#define SCREEN_WIDTH 240
#define SCREEN_HEIGHT 240
#define SCREEN_OFFSET 50
#define BL_PIN 5

unsigned long lastUdpProcessTime = 0;
unsigned long udpProcessInterval = 0;

#define AUDI_RED 0x0800 // RGB565
#define AUDI_HIGHLIGHTED_RED 0xF980 // RGB565

const int EXDURATION = 2;
const int TIMEOUT = 2;
const int PORT = 8266;

float v1Min = -80;
float v1Max = 120;
float v1Vline = 0;

float v2Min = 0.6;
float v2Max = 1.4;
float v2Vline = 1.0;

WiFiUDP Udp;

const int CHAR_SIZE = 18;  // Größe der Zeichen in Pixel

void drawCharToSprite(char c, int x, int y, TFT_eSprite &sprite, uint16_t color){
    String path;

    // Sonderzeichen escapen
    if(c == '/') path = "/font/slash.bin";
    else if(c == '\\') path = "/font/backslash.bin";
    else if(c == '.') path = "/font/dot.bin";
    else if(c == ',') path = "/font/comma.bin";
    else path = "/font/" + String(c) + ".bin";

    File f = LittleFS.open(path, "r");
    if(!f) return;

    uint8_t bmp[CHAR_SIZE*CHAR_SIZE];
    f.read(bmp, CHAR_SIZE*CHAR_SIZE);
    f.close();

    for(int row=0; row<CHAR_SIZE; row++){
        for(int col=0; col<CHAR_SIZE; col++){
            if(bmp[row*CHAR_SIZE + col]) // nur die Textpixel
                spr.drawPixel(x + col, y + row, color);
        }
    }
}

void drawText(const char* text, int x, int y);

int cursorX = 0;
int cursorY = 0;

// Cursor setzen
void setTextCursor(int x, int y){
    cursorX = x;
    cursorY = y;
}

// Textfarbe setzen (optional)
uint16_t textColor = AUDI_HIGHLIGHTED_RED;
void setTextColor(uint16_t color){
    textColor = color;
}

// Ein einzelnes Zeichen zeichnen und Cursor verschieben
void printChar(char c){
    drawCharToSprite(c, cursorX, cursorY, spr, textColor);
    cursorX += CHAR_SIZE;

    if(cursorX + CHAR_SIZE > 240){  // Zeilenumbruch
        cursorX = 0;
        cursorY += CHAR_SIZE;
    }
}

// Text ausgeben
void printText(const char* text){
    for(int i=0; text[i]; i++){
        if(text[i] == '\n'){
            cursorX = 0;
            cursorY += CHAR_SIZE;
        } else {
            printChar(text[i]);
        }
    }
}

void showClients() 
{
  unsigned char number_client;
  struct station_info *stat_info;
  
  struct ip4_addr *IPaddress;
  IPAddress address;
  int cnt=1;
  
  number_client = wifi_softap_get_station_num();
  stat_info = wifi_softap_get_station_info();
  
  Serial.print(F("Connected clients: "));
  Serial.println(number_client);

  while (stat_info != NULL)
  {
      IPaddress = &stat_info->ip;
      address = IPaddress->addr;

      Serial.print(cnt);
      Serial.print(F(": IP: "));
      Serial.print((address));
      Serial.print(F(" MAC: "));

      uint8_t *p = stat_info->bssid;
      Serial.printf("%02X:%02X:%02X:%02X:%02X:%02X", p[0], p[1], p[2], p[3], p[4], p[5]);

      stat_info = STAILQ_NEXT(stat_info, next);
      cnt++;
      Serial.println();
  }
}

void eventCb(System_Event_t *evt)
{
    switch (evt->event)
    {
      case WIFI_EVENT_SOFTAPMODE_DISTRIBUTE_STA_IP:
      case WIFI_EVENT_SOFTAPMODE_STADISCONNECTED:
      showClients();
      break;
      
    default:
        break;
    }
}

void initWiFi()
{
  Serial.println(F("Setting soft-AP ... "));
  wifi_set_event_handler_cb(eventCb);

  IPAddress apIP(192, 168, 4, 1);

  if (WiFi.softAPConfig(apIP, apIP, IPAddress(255, 255, 255, 0)))
    Serial.println(F("softAPConfig: True"));
  else
    Serial.println(F("softAPConfig: False"));

  if (WiFi.softAP(ssid, pass, 8))
    Serial.println(F("softAP: True"));
  else
    Serial.println(F("softAP: False"));
  
  IPAddress IP = WiFi.softAPIP();
  Serial.print(F("AP IP address: "));
  Serial.println(IP);

  if (WiFi.status() != WL_CONNECTED){
    WiFi.disconnect();
    WiFi.begin(F("CurrentDiag"), pass);
    Serial.println();
    Serial.print(F("Wait for WiFi"));

    while (WiFi.status() != WL_CONNECTED) {
      delay(500);
      Serial.print(F("."));
    }
    Serial.println();
    Serial.println(F("WiFi connected"));
    Serial.println(F("IP address: ") + WiFi.localIP().toString());
  }

  ElegantOTA.begin(&server);

  server.begin();

  Udp.begin(PORT);
  experimental::ESP8266WiFiGratuitous::stationKeepAliveSetIntervalMs(5000);
}

void drawValueBar(int x, int y, int width, int height, float valueMin, float valueMax, float value, float vlineValue, bool showNumbers) {
  float roundValue = min(max(valueMin, value), valueMax);
  float valueRange = valueMax - valueMin;
  float pxPerValue = (width - 4) / valueRange;
  int pxPositionVline = int(pxPerValue * (vlineValue - valueMin) + 2);
  int pxPositionValue = int(pxPerValue * (roundValue - valueMin) + 2);
  int start = min(pxPositionValue, pxPositionVline);
  int end = max(pxPositionValue, pxPositionVline);

  display.drawRect(x, y, width, height, AUDI_HIGHLIGHTED_RED);
  display.fillRect(x + start, y + 2, end - start, height - 4, AUDI_HIGHLIGHTED_RED);

  if (height >= 15 && showNumbers) {
    char roundValueStr[10];
    dtostrf(roundValue, 5, 2, roundValueStr);
    
    if (value >= vlineValue) {
      display.setTextSize(3);
      display.setTextColor(AUDI_HIGHLIGHTED_RED);
      display.setCursor(int(width / 9), y + 5);
      display.println(roundValueStr);
    } else {
      display.setTextSize(3);
      display.setTextColor(AUDI_HIGHLIGHTED_RED);
      display.setCursor(int(width / 1.5), y + 5);
      display.println(roundValueStr);
    }
  }

  display.drawFastVLine(pxPositionVline, y - 1, height + 2, AUDI_HIGHLIGHTED_RED);
}

void drawValueBarV2(int x, int y, int width, int height, float valueMin, float valueMax, float value, float vlineValue, bool showNumbers) {
  float roundValue = min(max(valueMin, value), valueMax);
  float valueRange = valueMax - valueMin;
  float pxPerValue = (width - 4) / valueRange;
  int pxPositionVline = int(pxPerValue * (vlineValue - valueMin) + 2);
  int pxPositionValue = int(pxPerValue * (roundValue - valueMin) + 2);
  int start = min(pxPositionValue, pxPositionVline);
  int end = max(pxPositionValue, pxPositionVline);

  spr.drawRect(x, y, width, height, AUDI_HIGHLIGHTED_RED);
  spr.fillRect(x + start, y + 2, end - start, height - 4, AUDI_HIGHLIGHTED_RED);

  if (height >= 15 && showNumbers) {
    char roundValueStr[10];
    dtostrf(roundValue, 5, 2, roundValueStr);
    
    if (value >= vlineValue) {
      spr.setTextSize(3);
      spr.setTextColor(AUDI_HIGHLIGHTED_RED);
      spr.setCursor(int(width / 9), y + 5);
      spr.println(roundValueStr);
    } else {
      spr.setTextSize(3);
      spr.setTextColor(AUDI_HIGHLIGHTED_RED);
      spr.setCursor(int(width / 1.5), y + 5);
      spr.println(roundValueStr);
    }
  }

  spr.drawFastVLine(pxPositionVline, y - 1, height + 2, AUDI_HIGHLIGHTED_RED);
}

#define SENSOR_HISTORY_SIZE 5

float sensor1History[SENSOR_HISTORY_SIZE];
float sensor2History[SENSOR_HISTORY_SIZE];
int historyIndex = 0;

void updateSensorHistory(float sensor1Value, float sensor2Value) {
  sensor1History[historyIndex] = sensor1Value;
  sensor2History[historyIndex] = sensor2Value;
  historyIndex = (historyIndex + 1) % SENSOR_HISTORY_SIZE;
}

void drawMinMaxValues() {
  float minSensor1 = sensor1History[0];
  float maxSensor1 = sensor1History[0];
  float minSensor2 = sensor2History[0];
  float maxSensor2 = sensor2History[0];

  for (int i = 1; i < SENSOR_HISTORY_SIZE; i++) {
    minSensor1 = min(minSensor1, sensor1History[i]);
    maxSensor1 = max(maxSensor1, sensor1History[i]);
    minSensor2 = min(minSensor2, sensor2History[i]);
    maxSensor2 = max(maxSensor2, sensor2History[i]);
  }

  display.fillRect(0, 125 + SCREEN_OFFSET, 240, 140, AUDI_RED);
  display.setTextSize(2);
  display.setTextColor(AUDI_RED);

  display.setTextSize(2);
  display.setTextColor(AUDI_HIGHLIGHTED_RED);
  display.setCursor(0, 125 + SCREEN_OFFSET);
  display.print(F("Act. "));
  display.print(minSensor1);
  display.print(F(" / "));
  display.println(maxSensor1);

  display.setTextSize(2);
  display.setTextColor(AUDI_HIGHLIGHTED_RED);
  display.setCursor(0, 150 + SCREEN_OFFSET);
  display.print(F("Lambda "));
  display.print(minSensor2);
  display.print(F(" / "));
  display.println(maxSensor2);
}

void processUdpPackets() {
  int packetSize = Udp.parsePacket();

  if (packetSize) {
    char packetBuffer[255];
    int len = Udp.read(packetBuffer, 255);

    if (len > 0) {
      packetBuffer[len] = '\0';
      const char* msg = packetBuffer;

      /* display.setTextSize(3);
      display.setTextColor(AUDI_RED);

      display.fillRect(90, 0 + SCREEN_OFFSET, 240 - 90, 22, AUDI_RED);
      display.fillRect(0 + 1, 25 + SCREEN_OFFSET + 1, 240 - 2, 22 - 2, AUDI_RED);

      display.fillRect(120, 50 + SCREEN_OFFSET, 240 - 120, 22, AUDI_RED);
      display.fillRect(0 + 1, 75 + SCREEN_OFFSET + 1, 240 - 2, 22 - 2, AUDI_RED);

      display.setTextColor(AUDI_HIGHLIGHTED_RED); */

      // JSON-Daten parsen und anzeigen
      DynamicJsonDocument data(255);
      DeserializationError error = deserializeJson(data, msg);

      if (error) {
        display.fillScreen(AUDI_RED);
        display.println(F("Error parsing JSON!"));
      } else {
        float sensor1Value = atof(data["sensor1"]);
        float sensor2Value = atof(data["sensor2"]);

        char sensor1ValueStr[10];
        char sensor2ValueStr[10];
        dtostrf(sensor1Value, 6, 2, sensor1ValueStr);
        dtostrf(sensor2Value, 3, 2, sensor2ValueStr);

        spr.fillSprite(AUDI_RED);

        setTextCursor(0, 0);
        setTextColor(AUDI_HIGHLIGHTED_RED);

        printText("Act. ");
        printText(sensor1ValueStr);
        printText("mA");
        drawValueBarV2(0, 25, 240, 22, v1Min, v1Max, sensor1Value, v1Vline, false);

        spr.pushSprite(0, 0);

        spr.fillSprite(AUDI_RED);

        setTextCursor(0, 0);
        setTextColor(AUDI_HIGHLIGHTED_RED);

        printText("Lambda ");
        printText(sensor2ValueStr);
        drawValueBarV2(0, 25, 240, 22, v2Min, v2Max, sensor2Value, v2Vline, false);

        spr.pushSprite(0, 50);

        //updateSensorHistory(sensor1Value, sensor2Value);

        /* display.setCursor(0, 0 + SCREEN_OFFSET);
        display.print(F("Act. "));
        display.print(sensor1ValueStr);
        display.println(F("mA"));
        drawValueBar(0, 25 + SCREEN_OFFSET, 240, 22, v1Min, v1Max, sensor1Value, v1Vline, false); */

        /* display.setCursor(0, 50 + SCREEN_OFFSET);
        display.print(F("Lambda "));
        display.print(sensor2ValueStr);
        display.println();
        drawValueBar(0, 75 + SCREEN_OFFSET, 240, 22, v2Min, v2Max, sensor2Value, v2Vline, false); */

        //drawMinMaxValues();
      }
    }
  }
}

// Problematische Zeichen werden gemappt
String getCharFile(char c){
    if(c == '/') return "/font/slash.bin";
    if(c == '\\') return "/font/backslash.bin";
    if(c == '.') return "/font/dot.bin";
    if(c == ',') return "/font/comma.bin";
    return "/font/" + String(c) + ".bin";
}

// Ein einzelnes Zeichen aus LittleFS-BMP zeichnen
void drawChar(char c, int x, int y){
    String path = getCharFile(c);
    uint8_t bmp[CHAR_SIZE*CHAR_SIZE];
    File f = LittleFS.open(path, "r");
    if(!f) return;
    f.read(bmp, CHAR_SIZE*CHAR_SIZE);
    f.close();

    // Pixels zeichnen
    for(int row=0; row<CHAR_SIZE; row++){
        for(int col=0; col<CHAR_SIZE; col++){
            if(bmp[row*CHAR_SIZE + col])
                spr.drawPixel(x+col, y+row, AUDI_HIGHLIGHTED_RED);
        }
    }
}

// Text zeichnen, automatisch Zeilenumbruch bei Bildschirmende
void drawText(const char* text, int x, int y){
    int cursorX = x;
    int cursorY = y;

    for(int i=0; text[i]; i++){
        drawChar(text[i], cursorX, cursorY);
        cursorX += CHAR_SIZE;
        if(cursorX + CHAR_SIZE > 240){
            cursorX = x;
            cursorY += CHAR_SIZE;
        }
    }
}

void setup() {
  Serial.begin(115200);
  while (!Serial)
  {
    ; // Needed for native USB port only
  }

  if(!LittleFS.begin()){
      Serial.println("LittleFS mount failed!");
      return;
  }

  display.init();
  // Optionally set colour depth to 8 or 16 bits, default is 16 if not spedified
  spr.setColorDepth(16);

  spr.createSprite(240, 48);

  /* display.setRotation(0);
  display.setTextColor(AUDI_HIGHLIGHTED_RED);
  display.fillScreen(AUDI_RED);
  display.setTextSize(3);
  display.setCursor(0, 0 + SCREEN_OFFSET);
  display.println(F("Connecting...")); */

  pinMode(BL_PIN, OUTPUT);
  digitalWrite(BL_PIN, LOW);

  initWiFi();
  delay(1000);
  display.fillScreen(AUDI_RED);
  spr.fillSprite(AUDI_RED);
}

void loop() {
  unsigned long currentTime = millis();

  if (currentTime - lastUdpProcessTime >= udpProcessInterval) {
    processUdpPackets();
    lastUdpProcessTime = currentTime;
  }

  yield();
}
